src/Documents/ДемоПриходнаяНакладная/ДемоПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДемоПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ДемоОстаткиТоваров</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.ДемоНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ДемоОстаткиТоваров/ДемоОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДемоОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ДемоПриходнаяНакладная/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДемоПриходнаяНакладнаяТовары.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ДемоПриходнаяНакладнаяТовары.Товар,
		|	ДемоПриходнаяНакладнаяТовары.Количество
		|ИЗ
		|	Документ.ДемоПриходнаяНакладная.Товары КАК ДемоПриходнаяНакладнаяТовары
		|ГДЕ
		|	ДемоПриходнаяНакладнаяТовары.Ссылка = &Ссылка";
		
	Движения.ДемоОстаткиТоваров.Записывать = Истина;
	Движения.ДемоОстаткиТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти
